[Survived] ObjectLiteral
template-ionic-vue-app/app/src/App.vue:11:32
 import { IonApp, IonRouterOutlet } from "@ionic/vue";
 import { defineComponent } from "vue";
 
-export default defineComponent({
-  name: "App",
-  components: {
-    IonApp,
-    IonRouterOutlet,
-  },
-});
+export default defineComponent({});
 </script>
 

[Survived] StringLiteral
template-ionic-vue-app/app/src/App.vue:12:9
 import { defineComponent } from "vue";
 
 export default defineComponent({
-  name: "App",
+  name: "",
   components: {
     IonApp,
