[Survived] ObjectLiteral
app/src/components/MessageListItem.vue:42:15
 
 export default defineComponent({
   name: "MessageListItem",
-  components: {
-    IonIcon,
-    IonItem,
-    IonLabel,
-    IonNote,
-  },
+  components: {},
   props: {
     message: Object,

[Survived] BlockStatement
app/src/components/MessageListItem.vue:51:10
   props: {
     message: Object,
   },
-  data() {
-    return { chevronForward };
-  },
+  data() {},
   methods: {
     isIos: () => {

[Survived] BlockStatement
app/src/components/MessageListItem.vue:55:18
     return { chevronForward };
   },
   methods: {
-    isIos: () => {
-      const win = window as any;
-      return win && win.Ionic && win.Ionic.mode === "ios";
-    },
+    isIos: () => {},
   },
 });

[Survived] ConditionalExpression
app/src/components/MessageListItem.vue:57:14
   methods: {
     isIos: () => {
       const win = window as any;
-      return win && win.Ionic && win.Ionic.mode === "ios";
+      return false;
     },
   },

[Survived] ConditionalExpression
app/src/components/MessageListItem.vue:57:14
   methods: {
     isIos: () => {
       const win = window as any;
-      return win && win.Ionic && win.Ionic.mode === "ios";
+      return false && win.Ionic.mode === "ios";
     },
   },
