[Survived] ObjectLiteral
app/src/data/messages.ts:9:3
 }
 
 const messages: Message[] = [
-  {
-    fromName: "Matt Chorsey",
-    subject: "New event: Trip to Vegas",
-    date: "9:32 AM",
-    id: 0,
-  },
+  {},
   {
     fromName: "Lauren Ruthford",

[Survived] StringLiteral
app/src/data/messages.ts:10:15
 
 const messages: Message[] = [
   {
-    fromName: "Matt Chorsey",
+    fromName: "",
     subject: "New event: Trip to Vegas",
     date: "9:32 AM",

[Survived] StringLiteral
app/src/data/messages.ts:11:14
 const messages: Message[] = [
   {
     fromName: "Matt Chorsey",
-    subject: "New event: Trip to Vegas",
+    subject: "",
     date: "9:32 AM",
     id: 0,

[Survived] StringLiteral
app/src/data/messages.ts:12:11
   {
     fromName: "Matt Chorsey",
     subject: "New event: Trip to Vegas",
-    date: "9:32 AM",
+    date: "",
     id: 0,
   },

[Survived] StringLiteral
app/src/data/messages.ts:17:14
   },
   {
     fromName: "Lauren Ruthford",
-    subject: "Long time no chat",
+    subject: "",
     date: "6:12 AM",
     id: 1,

[Survived] StringLiteral
app/src/data/messages.ts:28:15
     id: 2,
   },
   {
-    fromName: "Bill Thomas",
+    fromName: "",
     subject: "The situation",
     date: "Yesterday",

[Survived] ObjectLiteral
app/src/data/messages.ts:39:3
     date: "Yesterday",
     id: 4,
   },
-  {
-    fromName: "Andrea Cornerston",
-    subject: "Last minute ask",
-    date: "Yesterday",
-    id: 5,
-  },
+  {},
   {
     fromName: "Moe Chamont",

[Survived] StringLiteral
app/src/data/messages.ts:41:14
   },
   {
     fromName: "Andrea Cornerston",
-    subject: "Last minute ask",
+    subject: "",
     date: "Yesterday",
     id: 5,

[Survived] StringLiteral
app/src/data/messages.ts:48:11
   {
     fromName: "Moe Chamont",
     subject: "Family Calendar - Version 1",
-    date: "Last Week",
+    date: "",
     id: 6,
   },

[Survived] ArrowFunction
app/src/data/messages.ts:59:28
   },
 ];
 
-export const getMessages = () => messages;
+export const getMessages = () => undefined;
 
 export const getMessage = (id: number) => messages.find((m) => m.id === id);

[Survived] ConditionalExpression
app/src/data/messages.ts:61:64
 
 export const getMessages = () => messages;
 
-export const getMessage = (id: number) => messages.find((m) => m.id === id);
+export const getMessage = (id: number) => messages.find((m) => false);
 

[Survived] ConditionalExpression
app/src/data/messages.ts:61:64
 
 export const getMessages = () => messages;
 
-export const getMessage = (id: number) => messages.find((m) => m.id === id);
+export const getMessage = (id: number) => messages.find((m) => true);
 
