[Survived] BlockStatement
template-ionic-vue-app/app/src/main.ts:28:29
 
 const app = createApp(App).use(IonicVue).use(router);
 
-router.isReady().then(() => {
-  app.mount("#app");
-});
+router.isReady().then(() => {});
 

[Survived] StringLiteral
template-ionic-vue-app/app/src/main.ts:29:13
 const app = createApp(App).use(IonicVue).use(router);
 
 router.isReady().then(() => {
-  app.mount("#app");
+  app.mount("");
 });
 
