[Survived] ArrayDeclaration
app/src/router/index.ts:5:39
 import { RouteRecordRaw } from "vue-router";
 import Home from "../views/Home.vue";
 
-const routes: Array<RouteRecordRaw> = [
-  {
-    path: "/",
-    redirect: "/home",
-  },
-  {
-    path: "/home",
-    name: "Home",
-    component: Home,
-  },
-  {
-    path: "/message/:id",
-    component: () => import("../views/ViewMessage.vue"),
-  },
-];
+const routes: Array<RouteRecordRaw> = [];
 
 const router = createRouter({

[Survived] StringLiteral
app/src/router/index.ts:7:11
 
 const routes: Array<RouteRecordRaw> = [
   {
-    path: "/",
+    path: "",
     redirect: "/home",
   },

[Survived] StringLiteral
app/src/router/index.ts:8:15
 const routes: Array<RouteRecordRaw> = [
   {
     path: "/",
-    redirect: "/home",
+    redirect: "",
   },
   {

[Survived] StringLiteral
app/src/router/index.ts:12:11
   },
   {
     path: "/home",
-    name: "Home",
+    name: "",
     component: Home,
   },

[Survived] ObjectLiteral
app/src/router/index.ts:15:3
     name: "Home",
     component: Home,
   },
-  {
-    path: "/message/:id",
-    component: () => import("../views/ViewMessage.vue"),
-  },
+  {},
 ];
 

[Survived] ArrowFunction
app/src/router/index.ts:17:16
   },
   {
     path: "/message/:id",
-    component: () => import("../views/ViewMessage.vue"),
+    component: () => undefined,
   },
 ];

[Survived] StringLiteral
app/src/router/index.ts:17:29
   },
   {
     path: "/message/:id",
-    component: () => import("../views/ViewMessage.vue"),
+    component: () => import(""),
   },
 ];

[Survived] ObjectLiteral
app/src/router/index.ts:21:29
   },
 ];
 
-const router = createRouter({
-  history: createWebHistory(process.env.BASE_URL),
-  routes,
-});
+const router = createRouter({});
 
 export default router;
