[Survived] BlockStatement
app/src/views/Home.vue:59:10
     IonToolbar,
     MessageListItem,
   },
-  data() {
-    return {
-      messages: getMessages(),
-    };
-  },
+  data() {},
   methods: {
     refresh: (ev: CustomEvent) => {

[Survived] ObjectLiteral
app/src/views/Home.vue:64:12
       messages: getMessages(),
     };
   },
-  methods: {
-    refresh: (ev: CustomEvent) => {
-      setTimeout(() => {
-        ev.detail.complete();
-      }, 3000);
-    },
-  },
+  methods: {},
 });
 </script>

[Survived] BlockStatement
app/src/views/Home.vue:65:35
     };
   },
   methods: {
-    refresh: (ev: CustomEvent) => {
-      setTimeout(() => {
-        ev.detail.complete();
-      }, 3000);
-    },
+    refresh: (ev: CustomEvent) => {},
   },
 });

[Survived] BlockStatement
app/src/views/Home.vue:66:24
   },
   methods: {
     refresh: (ev: CustomEvent) => {
-      setTimeout(() => {
-        ev.detail.complete();
-      }, 3000);
+      setTimeout(() => {}, 3000);
     },
   },
