[Survived] ObjectLiteral
app/src/views/ViewMessage.vue:64:15
 
 export default defineComponent({
   name: "Home",
-  components: {
-    IonBackButton,
-    IonButtons,
-    IonContent,
-    IonHeader,
-    IonIcon,
-    IonItem,
-    IonLabel,
-    IonNote,
-    IonPage,
-    IonToolbar,
-  },
+  components: {},
   setup() {
     const route = useRoute();

[Survived] BlockStatement
app/src/views/ViewMessage.vue:76:11
     IonPage,
     IonToolbar,
   },
-  setup() {
-    const route = useRoute();
-    const message = getMessage(parseInt(route.params.id as string, 10));
-
-    return { message };
-  },
+  setup() {},
   data() {
     return {

[Survived] ObjectLiteral
app/src/views/ViewMessage.vue:80:12
     const route = useRoute();
     const message = getMessage(parseInt(route.params.id as string, 10));
 
-    return { message };
+    return {};
   },
   data() {

[Survived] BlockStatement
app/src/views/ViewMessage.vue:82:10
 
     return { message };
   },
-  data() {
-    return {
-      personCircle,
-      getBackButtonText: () => {
-        const win = window as any;
-        const mode = win && win.Ionic && win.Ionic.mode;
-        return mode === "ios" ? "Inbox" : "";
-      },
-    };
-  },
+  data() {},
 });
 </script>

[Survived] BlockStatement
app/src/views/ViewMessage.vue:85:32
   data() {
     return {
       personCircle,
-      getBackButtonText: () => {
-        const win = window as any;
-        const mode = win && win.Ionic && win.Ionic.mode;
-        return mode === "ios" ? "Inbox" : "";
-      },
+      getBackButtonText: () => {},
     };
   },

[Survived] LogicalOperator
app/src/views/ViewMessage.vue:87:22
       personCircle,
       getBackButtonText: () => {
         const win = window as any;
-        const mode = win && win.Ionic && win.Ionic.mode;
+        const mode = win || win.Ionic && win.Ionic.mode;
         return mode === "ios" ? "Inbox" : "";
       },

[Survived] ConditionalExpression
app/src/views/ViewMessage.vue:87:22
       personCircle,
       getBackButtonText: () => {
         const win = window as any;
-        const mode = win && win.Ionic && win.Ionic.mode;
+        const mode = false;
         return mode === "ios" ? "Inbox" : "";
       },

[Survived] ConditionalExpression
app/src/views/ViewMessage.vue:88:16
       getBackButtonText: () => {
         const win = window as any;
         const mode = win && win.Ionic && win.Ionic.mode;
-        return mode === "ios" ? "Inbox" : "";
+        return true ? "Inbox" : "";
       },
     };

[Survived] EqualityOperator
app/src/views/ViewMessage.vue:88:16
       getBackButtonText: () => {
         const win = window as any;
         const mode = win && win.Ionic && win.Ionic.mode;
-        return mode === "ios" ? "Inbox" : "";
+        return mode !== "ios" ? "Inbox" : "";
       },
     };
